Revit 2026 API

# BarTerminationsData Methods

---

The BarTerminationsData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AsRebarShapeTerminationsData | Creates a new instance of RebarShapeTerminationsData from this. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDocument | Gets the document containing the hook type ids, end treatment ids and crank type ids. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

BarTerminationsData Class

Autodesk.Revit.DB.Structure Namespace